In [1]:
import pandas as pd
dataset=pd.read_csv('loan.csv')

In [5]:
dataset.head(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y

In [11]:
dataset.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [19]:
# to remove null values
dataset['Gender'].fillna(dataset['Gender'].mode()[0],inplace=True);
dataset['Married'].fillna(dataset['Married'].mode()[0],inplace=True);

C:\Users\91935\AppData\Local\Temp\ipykernel_16408\1960864909.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['Married'].fillna(dataset['Married'].mode()[0],inplace=True);

In [21]:
dataset.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [23]:
en_data=dataset[['Gender','Married']]

In [43]:
dummy_en_data=pd.get_dummies(en_data)

In [45]:
dummy_en_data.head()

   Gender_Female  Gender_Male  Married_No  Married_Yes
0          False         True        True        False
1          False         True       False         True
2          False         True       False         True
3          False         True       False         True
4          False         True        True        False

In [51]:
dummy_en_data['Gender_Male'] = dummy_en_data['Gender_Male'].astype(int)
dummy_en_data['Married_Yes'] = dummy_en_data['Married_Yes'].astype(int)

In [63]:
dummy_en_data.head()

   Gender_Female  Gender_Male  Married_No  Married_Yes
0          False            1        True            0
1          False            1       False            1
2          False            1       False            1
3          False            1       False            1
4          False            1        True            0

In [67]:
dummy_en_data.drop(columns=["Gender_Female","Married_No"],inplace=True)
# dummy_en_data.drop(columns=columns_to_drop, inplace=True)

In [69]:
dummy_en_data.head()

   Gender_Male  Married_Yes
0            1            0
1            1            1
2            1            1
3            1            1
4            1            0

In [71]:
from sklearn.preprocessing import OneHotEncoder

In [94]:
ohe=OneHotEncoder(drop='first')
# making object

In [96]:
arr=ohe.fit_transform(en_data).toarray()
print(arr)

[[1. 0.]
 [1. 1.]
 [1. 1.]
 ...
 [1. 1.]
 [1. 1.]
 [0. 0.]]

In [102]:
# pd.DataFrame(arr,columns=['Gender_Female','Gender_Male','Married_No','Married_Yes'])
df = pd.DataFrame(arr, columns=[ 'Gender_Male','Married_Yes'])

In [104]:
df.head()

   Gender_Male  Married_Yes
0          1.0          0.0
1          1.0          1.0
2          1.0          1.0
3          1.0          1.0
4          1.0          0.0